"""
    防止函数传入列表是修改外部数据
"""
import copy


def fun1(list1):
    print(f"修改前列表：{list1}，地址：{id(list1)}")
    list1.append(100)
    print(f"修改后列表：{list1}，地址：{id(list1)}")


list2 = [1, 2, 3]
print(f"修改前列表：{list2}，地址：{id(list2)}")
fun1(list2)
print(f"修改后列表：{list2}，地址：{id(list2)}")
'''
修改前列表：[1, 2, 3]，地址：1628399866240
修改前列表：[1, 2, 3]，地址：1628399866240
修改后列表：[1, 2, 3, 100]，地址：1628399866240
修改后列表：[1, 2, 3, 100]，地址：1628399866240'''
# 创建新对象 list3=list2[:] 并不一定可以避免
# 例如list1=[1,2,3,[10,20,30]]
# 执行list1[3].append(111)  #结果依旧修改外部数据

def fun1(list1):
    print(f"修改前列表：{list1}，地址：{id(list1)}")
    list1[3].append(100)
    print(f"修改后列表：{list1}，地址：{id(list1)}")
list2 = [1, 2, 3,[10,20,30]]
print("深拷贝：--------------------------")
list4=copy.deepcopy(list2) #深拷贝
print(f"修改前列表：{list2}，地址：{id(list2)}")
fun1(list4)
print(f"修改后列表：{list2}，地址：{id(list2)}")
print("浅拷贝：--------------------------")
list3=list2[:] #浅拷贝
print(f"修改前列表：{list2}，地址：{id(list2)}")
fun1(list3)
print(f"修改后列表：{list2}，地址：{id(list2)}")
print("--------------------------")
'''
深拷贝：--------------------------
修改前列表：[1, 2, 3, [10, 20, 30]]，地址：1768467182656
修改前列表：[1, 2, 3, [10, 20, 30]]，地址：1768466880704
修改后列表：[1, 2, 3, [10, 20, 30, 100]]，地址：1768466880704
修改后列表：[1, 2, 3, [10, 20, 30]]，地址：1768467182656
浅拷贝：--------------------------
修改前列表：[1, 2, 3, [10, 20, 30]]，地址：1768467182656
修改前列表：[1, 2, 3, [10, 20, 30]]，地址：1768500457088
修改后列表：[1, 2, 3, [10, 20, 30, 100]]，地址：1768500457088
修改后列表：[1, 2, 3, [10, 20, 30, 100]]，地址：1768467182656
--------------------------'''

