# 算术运算符
#   + - * / // **
#   /正常除法运算，//表示整除，向下取整，
#   **幂运算
# print(5 / 2)    #2.5
# print(5 // 2)   #2
# print(5 ** 2)   #25

# 赋值运算符
#   = += -= *= /=...
#   := 海象运算符  在表达式中同时进行赋值和返回赋值后的值
# int1 = 10
# int2 = 20
# print((int1=30) > int2) 报错
# print((int := 30) > int2) #True

# 比较运算符
#   == ！= > < >= <=
#   不同类型不支持比较，字符串默认比较首字符ASCII

# 逻辑运算符
#   and or not
#   and：x and y，若x为False时返回x，否者返回y
#   or：x or y，若x为True时返回x，否则返回y
#   当两边是表达式的时候，重点不是算出两边的值再bool值判断，而是先拿到左侧结果判断bool在根据and/or，决定返回哪一侧
#   短路求值
#   常用的是or设置默认值。例子：name=input("请输入名字") or"匿名用户"

# 位运算 (需要转换成二进制再运算,以补码形式进行计算)
#   &按位或  |按位或  ^按位异或  ~按位取反
#   <<左移[*2]  >>有右移[/2]
#   正数:原码,反码,补码都一样
#   负数:原码(最高位符号位1),反码(除最高位不变其余取反),补码(反码加1)
#   注意运算结束后是"补码",需要求出原码之后显示(负数需要注意,正数三码合一)
#   17>>3 (8,4,2)实际答案是2
#   -12>>3 (-6,-3,-1.5)实际答案是-2 向负无穷取整,向下取整

# 成员运算符
#   in ,not in
# list1 = [10, 20, 30]
# print(10 in list1)
# print(100 not in list1)

# 身份运算符(是否用一个对象，即地址)
#   is , not is
num1 = 10
num2 = 10
print(num1 == num2)  # num1等于num2
print(num1 is num2)  # num1等于num2，地址也一样
list1 = [1, 2, 3]
list2 = list1[:]
print(list1 == list2)  # 值一样
print(list1 is list2)  # 地址不一样
